turbulento_newtonian/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

//Note Rofrigo voce não pode definir ao mesmo tempo pressão e velocidade, se definir num, deixa ZeroGradiente no outro.

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 15);
    }

    walls
    {
        type            noSlip;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
